Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::RoutingElementUIManager Class Referencefinal
MEP Element Manager
The RoutingElementUIManager contains UI-related services for a Routing element. More...
#include <MEPRoutingElementUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingElementUIManager:
 Public Member Functions
Result< RoutingElementDefault >  | CreateRoutingElementDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a RoutingElementDefault from a toolUIData.
Result< void >  | ApplyRoutingElementDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const RoutingElementDefault &routingElementDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< RoutingElementUIManager >  | CreateRoutingElementUIManager ()
Creates a RoutingElementUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RoutingElementUIManager contains UI-related services for a Routing element.
Since
Archicad 28
Member Function Documentation
◆ ApplyRoutingElementDefaultToToolUIData()
 Result< void > ACAPI::MEP::v1::RoutingElementUIManager::ApplyRoutingElementDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData &  |  toolUIData,
|  const RoutingElementDefault &  |  routingElementDefault
)
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
routingElementDefault | The default to be set
Returns
Returns error if the RoutingElementDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateRoutingElementDefaultFromToolUIData()
 Result< RoutingElementDefault > ACAPI::MEP::v1::RoutingElementUIManager::CreateRoutingElementDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData &  |  toolUIData | )
Creates a RoutingElementDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the RoutingElement in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an RoutingElementDefault, otherwise returns the RoutingElementDefault created from it.
Friends And Related Symbol Documentation
◆ CreateRoutingElementUIManager
 Result< RoutingElementUIManager > CreateRoutingElementUIManager  |  ( |   | )
friend
Creates a RoutingElementUIManager.
Returns
If able, creates a new manager for RoutingElement, otherwise Error.